#MODEL_API_URL = "http://115.190.98.68:8012/v1/chat/completions"
MODEL_API_URL = "http://10.130.35.241:8000/v1/chat/completions"
MODEL_NAME = "Qwen3-14B"

# 音频处理配置
#FUNASR_BASE_URL = "http://115.190.98.68:8010"
FUNASR_BASE_URL = "http://10.130.35.238:8000"
USE_AUDIO_PROXY = True
AUDIO_PROXY_CONFIG = {
    'http': 'http://proxy-lan.quantgroup.cn:1087',
    'https': 'http://proxy-lan.quantgroup.cn:1087'
}

# 诉点标签体系（一级-二级）
COMPLAINT_DOMAIN_INTENT_MAP = {
    "催收业务": ["催收违规", "催收咨询", "催收其他"],
    "息费业务": ["息费争议", "协商还款", "息费其他"],
    "征信业务": ["征信异议", "征信其他"],
    "其他业务": ["还款异常", "资料办理", "其他"]
}

# 诉点标签体系（二级-三级）
COMPLAINT_SECOND_THIRD_INTENT_MAP = {
    "催收违规": ["催收违规本人", "催收违规三方", "高频致电催收本人", "高频致电催收三方", "催收致电时间不当", "已还款仍被催收", \
        "已办理停催仍被催收", "不满联系三方", "催收信息泄露", "引导第三方代偿", "不认识借款人", "其他催收违规"],
    "催收咨询": ["咨询法院催收相关问题", "咨询债权转让相关问题", "咨询催收公司的名字", "咨询催收员的名字", "其他催收咨询"],
    "息费争议": ["对利息或者综合利率不满", "对担保费不满", "对违约金不满", "对费用结构不满", "其他息费争议"],
    "协商还款": ["本人失业", "本人大病", "家人大病", "多头逾期", "资金紧张", "其他协商还款"],
    "征信异议": ["违规查询征信", "违规上报征信", "咨询征信相关规则", "不可抗力因素", "其他征信异议"],
    "还款异常": ["卡异常", "支付异常", "其他还款异常"],
    "资料办理": ["办理结清证明", "办理发票", "调取合同", "办理还款明细", "其他资料办理"]
}

RECONCILIATION_INTENT_MAP = {
    "认可": ["认可"],
    "不认可": ["不认可"],
    "其他": ["其他"]
}

# 解决方案标签体系（一级-二级）
SOLUTION_DOMAIN_INTENT_MAP = {
    "催收业务": ["停催", "催收其他"],
    "息费业务": ["退赔", "协商还款", "息费其他"],
    "征信业务": ["删除逾期征信记录", "修改征信上报内容", "调取征信授权书", "征信异议答复", "征信其他"],
    "其他业务": ["咨询解答", "安抚致歉", "资料办理", "升级反馈", "其他"]
}

# 解决方案标签体系（二级-三级）
SOLUTION_SECOND_THIRD_INTENT_MAP = {
    "停催": ["停催本人", "部分还款停催本人", "仅停催三方", "其他停催"],
    "退赔": ["退费", "赔偿", "其他退赔"],
    "协商还款": ["无减免一次性结清", "有减免一次性结清", "延期还款", "再分期", "其他协商还款"],
    "安抚致歉": ["道歉", "解释安抚", "其他安抚致歉"],
    "资料办理": ["办理结清证明", "办理发票", "调取合同", "办理还款明细", "其他资料办理"],
    "升级反馈": ["升级处理", "加急催办", "其他升级反馈"]
}

# 诉求标签体系（一级-二级）
APPEAL_DOMAIN_INTENT_MAP = {
    "催收业务": ["停催", "催收其他"],
    "息费业务": ["退赔", "协商还款", "息费其他"],
    "征信业务": ["删除逾期征信记录", "修改征信上报内容", "调取征信授权书", "征信异议答复", "征信其他"],
    "其他业务": ["咨询解答", "安抚致歉", "资料办理", "其他"]
}

# 诉求标签体系（二级-三级）
APPEAL_SECOND_THIRD_INTENT_MAP = {
    "停催": ["停催本人", "部分还款停催本人", "仅停催三方", "其他停催"],
    "退赔": ["退费", "赔偿", "其他退赔"],
    "协商还款": ["无减免一次性结清", "有减免一次性结清", "延期还款", "再分期", "其他协商还款"],
    "安抚致歉": ["道歉", "解释安抚", "其他安抚致歉"],
    "资料办理": ["办理结清证明", "办理发票", "调取合同", "办理还款明细", "其他资料办理"]
}